---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypePreferredBranchParam
source: html/7515d22f-ea5a-c572-6693-9066d49b7413.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypePreferredBranchParam Property

"Preferred Junction Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsCurvetypePreferredBranchParam { get; }
```